const config = {
  "inputter": [           // 为接收外部数据创建的监听端口
    {"http" : "127.0.0.1:8000"},
    //{"ws"   : "127.0.0.1:6000"},
    //{"tcp"  : "127.0.0.1:9000"},
  ],
  "outputter_listen": [   // 为输出数据创建的监听端口
    {"http" : "127.0.0.1:8001"},
    //{"ws"   : "127.0.0.1:6001"},
    //{"tcp"  : "127.0.0.1:9001"},
  ],
  "outputter_connect": [  // 为输出主动连接其它端口
    {"http" : "127.0.0.1:8002"},
    //{"ws"   : "127.0.0.1:6002"},
    //{"tcp"  : "127.0.0.1:9002"},
  ],
  "monitor": [            // 为监控本 node-net-xxx 状况创建的监听端口
    {"http" : "127.0.0.1:8003"},
    //{"ws"   : "127.0.0.1:6003"},
    //{"tcp"  : "127.0.0.1:9003"},
  ]
};

module.exports = config;
