/*
  node-net-xxx 配置文件;
  因 json 文件不支持写注释,且格式过于严格,故用 js 里的 json 对象做配置
*/
const config = {
  "monitor": [            // 为监控本 node-net-xxx 状况创建的监听端口
    {"http" : "192.168.1.99:8000"},
    {"http" : "192.168.1.99:9000"},
    {"http" : "127.0.0.1:7000"},
    //{"ws"   : "127.0.0.1:7000"},
    //{"ws"   : "127.0.0.1:6000"},
    //{"tcp"  : "127.0.0.1:9000"},
  ],
  "inputter": [           // 为接收外部数据创建的监听端口
    {"http" : "127.0.0.1:8001"},
    //{"ws"   : "127.0.0.1:6001"},
    //{"tcp"  : "127.0.0.1:9001"},
  ],
  "listen_outputter": [   // 为输出数据创建的监听端口
    {"http" : "127.0.0.1:8002"},
    //{"ws"   : "127.0.0.1:6002"},
    //{"tcp"  : "127.0.0.1:9002"},
  ],
  "connect_outputter": [  // 为输出主动连接其它端口
    {"http" : "127.0.0.1:80"},
    //{"ws"   : "127.0.0.1:6003"},
    //{"tcp"  : "127.0.0.1:9003"},
  ]
};

module.exports = config;
